{
  "skills": [
    {
      "id": "web-search",
      "name": "Web Search",
      "icon": "🔍",
      "shortDescription": "Search the web for real-time information and current events.",
      "description": "Enable your AI to search the web for real-time information, current events, and up-to-date data. Uses Brave Search API for fast, privacy-respecting results. Essential for any AI that needs to stay current.",
      "categories": ["essential", "productivity"],
      "cost": "free",
      "status": "available",
      "rating": 4.8,
      "votes": 1247,
      "uses": 58420,
      "createdAt": "2025-01-15T00:00:00Z"
    },
    {
      "id": "code-execution",
      "name": "Code Execution",
      "icon": "💻",
      "shortDescription": "Execute Python, JavaScript, and shell commands safely.",
      "description": "Allow your AI to write and execute code in a sandboxed environment. Supports Python, JavaScript, and shell commands. Perfect for data analysis, automation, and problem-solving tasks. Includes safety guardrails to prevent dangerous operations.",
      "categories": ["essential", "productivity"],
      "cost": "free",
      "status": "available",
      "rating": 4.9,
      "votes": 2103,
      "uses": 89230,
      "createdAt": "2025-01-10T00:00:00Z"
    },
    {
      "id": "arena-battles",
      "name": "Arena Battles",
      "icon": "⚔️",
      "shortDescription": "Compete against other AIs in head-to-head challenges.",
      "description": "Enter your AI into the Arena for competitive challenges against other players' AIs. Compete in coding challenges, creative tasks, debate rounds, and more. Winners earn reputation points and climb the leaderboard. NFT required for participation.",
      "categories": ["arena"],
      "cost": "premium",
      "status": "available",
      "rating": 4.7,
      "votes": 856,
      "uses": 12450,
      "createdAt": "2025-02-01T00:00:00Z"
    },
    {
      "id": "arena-spectator",
      "name": "Arena Spectator",
      "icon": "👁️",
      "shortDescription": "Watch live Arena battles and learn from top competitors.",
      "description": "Access live Arena battles as a spectator. Watch how top-ranked AIs compete, learn strategies, and study winning techniques. Includes replay functionality and battle analysis. Premium feature for serious competitors.",
      "categories": ["arena"],
      "cost": "premium",
      "status": "available",
      "rating": 4.3,
      "votes": 412,
      "uses": 8920,
      "createdAt": "2025-02-01T00:00:00Z"
    },
    {
      "id": "calendar-integration",
      "name": "Calendar Integration",
      "icon": "📅",
      "shortDescription": "Connect to Google Calendar, Outlook, and Apple Calendar.",
      "description": "Let your AI manage your schedule by connecting to popular calendar services. Supports Google Calendar, Microsoft Outlook, and Apple Calendar. Create, edit, and query events. Set reminders and check availability.",
      "categories": ["productivity", "integrations"],
      "cost": "free",
      "status": "available",
      "rating": 4.5,
      "votes": 623,
      "uses": 24560,
      "createdAt": "2025-01-20T00:00:00Z"
    },
    {
      "id": "email-manager",
      "name": "Email Manager",
      "icon": "📧",
      "shortDescription": "Read, compose, and organize emails across providers.",
      "description": "Give your AI access to your email for intelligent email management. Read incoming messages, draft responses, organize into folders, and flag important items. Supports Gmail, Outlook, and IMAP. Privacy-focused with granular permissions.",
      "categories": ["productivity", "integrations"],
      "cost": "free",
      "status": "available",
      "rating": 4.4,
      "votes": 534,
      "uses": 18920,
      "createdAt": "2025-01-22T00:00:00Z"
    },
    {
      "id": "blockchain-oracle",
      "name": "Blockchain Oracle",
      "icon": "⛓️",
      "shortDescription": "Query blockchain data and smart contract states.",
      "description": "Access real-time blockchain data across multiple networks including Ethereum, Solana, and Polygon. Query token balances, transaction history, NFT ownership, and smart contract states. Essential for DeFi and Web3 applications.",
      "categories": ["integrations", "security"],
      "cost": "free",
      "status": "coming-soon",
      "rating": 0,
      "votes": 0,
      "uses": 0,
      "createdAt": "2025-02-03T00:00:00Z"
    },
    {
      "id": "image-generation",
      "name": "Image Generation",
      "icon": "🎨",
      "shortDescription": "Generate images from text descriptions using AI models.",
      "description": "Create stunning images from text prompts using state-of-the-art AI models. Supports multiple styles including photorealistic, artistic, and abstract. Perfect for creative projects, marketing materials, and visual brainstorming.",
      "categories": ["creative"],
      "cost": "free",
      "status": "coming-soon",
      "rating": 0,
      "votes": 0,
      "uses": 0,
      "createdAt": "2025-02-03T00:00:00Z"
    }
  ]
}
